Tekla.Structures.Analysis.AnalysisModelJobProperties
The AnalysisModelJobProperties class contains information related to analysis model job properties.

Tekla.Structures.Analysis.AnalysisModelJobProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelJobProperties._JobName
The name of the job.

Tekla.Structures.Analysis.AnalysisModelJobProperties._ClientName
The name of the client.

Tekla.Structures.Analysis.AnalysisModelJobProperties._JobNumber
The number of the job.

Tekla.Structures.Analysis.AnalysisModelJobProperties._JobComment
The comment of the job.

Tekla.Structures.Analysis.AnalysisModelJobProperties._PartNumber
The number of the part.

Tekla.Structures.Analysis.AnalysisModelJobProperties._ReferenceNumber
The reference number.

Tekla.Structures.Analysis.AnalysisModelJobProperties._EngineerName
The name of the engineer.

Tekla.Structures.Analysis.AnalysisModelJobProperties._EngineerDate
The date of the engineering.

Tekla.Structures.Analysis.AnalysisModelJobProperties._CheckerName
The name of the checker.

Tekla.Structures.Analysis.AnalysisModelJobProperties._CheckerDate
The date of the checking.

Tekla.Structures.Analysis.AnalysisModelJobProperties._ApprovedName
The name of approver.

Tekla.Structures.Analysis.AnalysisModelJobProperties._ApprovedDate
The date of the approval.

Tekla.Structures.Analysis.AnalysisModelJobProperties._DateDelimiter
The date delimiter;

Tekla.Structures.Analysis.AnalysisModelJobProperties.JobName
The name of the job.

Tekla.Structures.Analysis.AnalysisModelJobProperties.ClientName
The name of the client.

Tekla.Structures.Analysis.AnalysisModelJobProperties.JobNumber
The number of the job.

Tekla.Structures.Analysis.AnalysisModelJobProperties.JobComment
The comment of the job.

Tekla.Structures.Analysis.AnalysisModelJobProperties.PartNumber
The number of the part.

Tekla.Structures.Analysis.AnalysisModelJobProperties.ReferenceNumber
The reference number.

Tekla.Structures.Analysis.AnalysisModelJobProperties.EngineerName
The name of the engineer.

Tekla.Structures.Analysis.AnalysisModelJobProperties.EngineerDate
The date of the engineering.

Tekla.Structures.Analysis.AnalysisModelJobProperties.CheckerName
The name of the checker.

Tekla.Structures.Analysis.AnalysisModelJobProperties.CheckerDate
The date of the checking.

Tekla.Structures.Analysis.AnalysisModelJobProperties.ApprovedName
The name of approver.

Tekla.Structures.Analysis.AnalysisModelJobProperties.ApprovedDate
The date of the approval.

Tekla.Structures.Analysis.AnalysisModelJobProperties.Modify(System.String)
Inserts the analysis model job properties.
The AnalysisModelName has to be set.
AnalysisModelName: The name of the analysis model.

Tekla.Structures.Analysis.AnalysisModelJobProperties.Select(System.String)
Selects the analysis model job properties.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisModelJobProperties.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisModelJobProperties.SelectInstance
DO NOT USE! For internal usage only!